---
kind: enumMember
id: F:Autodesk.Revit.DB.EndCapCondition.None
enum: Autodesk.Revit.DB.EndCapCondition
source: html/2ee406b8-42de-d7cd-e628-cf7c0c32dec0.htm
---
# Autodesk.Revit.DB.EndCapCondition.None

None of the shell layers participate in end wrapping.